if($text =="م3"  ){
	if ( $status == 'creator' or $status == 'administrator' or in_array($from_id,$Dev) or in_array($from_id,$manger) or in_array($from_id,$admin_user) or in_array($from_id,$developer)) {	if ($tc == 'group' | $tc == 'supergroup'){  
	$add = $settings["information"]["added"];
if ($add == true) {
  	bot('sendmessage',[
  	'chat_id'=>$chat_id,
  	'text'=>"📮- اهـلا بـك فـي اوامـر م3 للاعدادات 
➺┄─━━━━━━━━━━─┄⊰
🔘¦ وضع قوانين + نص ⊱ لوضع قوانين ⊰ 
كمثال { وضع قوانين ممنوع المعرفات } 

🔘¦ وضع الاعضاء + العدد ⊱ لتحدد عدد لاضافة ⊰ 
كمثال { وضع الاعضاء 5 } 

🔘¦ وضع تكرار + العدد ⊱ لوضع التكرار ⊰ 
كمثال { وضع تكرار 5 } 

🔘¦ لمنع كلمه [ منع كلمه نص ]
كمثال { منع كلمه احا } 

🔘¦ الغاء منع كلمه [ منع كلمه نص ]
كمثال { الغاء منع كلمه احا }

🔘¦ [ لعرض قائمة المنع ] الممنوعات [ لحذف قائمة المنع ] مسح الممنوعات

🔘¦ تثبيت ⊱ بالرد على الرسالة لتثبيتها ⊰ 
🔘¦ الغاء التثبيت ⊱ لالغاء تثبيت الرسالة ⊰ 

🔘¦ الادمنية ⊱ لإظهار الأدمنية في المجموعة ⊰

🔘¦ لتشفير نص [ تشفير + الكلمه ]
🔘¦ لفك تشفير نص [ الغاء تشفير + الشفره ]

🔘¦ لزخرفه نص [ زخرفه + الكلمه ]
كمثال { زخرفه شيكو } 

🔘¦ [ لتظيف الرسائل ] تنظيف + عدد
كمثال { تنظيف 100 } 
🔘¦ [ لمسح رساله بالرد ] مسح

🔘¦ لعمل تاك [ تاك للكل ] 
🔘¦ لاظهار اسمك { اسمي } 
🔘¦ لاظهار الوقت { الوقت } 
🔘¦ لاظهار الايدي { ايدي } 
🔘¦ لكشف شخص بالرد { كشف } 
🔘¦ لاظهار جهاتك { جهاتي } 
🔘¦ لاظهار رتبتك { رتبتي } 
➺┄─━━━━━━━━━━─┄ ⊰
📮¦تم عرض م3
",
    'reply_to_message_id'=>$message_id,
  	]);
  	}
else
{
bot('sendmessage',[
	'chat_id'=>$chat_id,
	'text'=>"📍 لم يتم تفعيل البوت في المجموعة ! م̷ـــِْن فضلك قم بتفغيل البوت بإرسال
ℹ️ `تفعيل ` البوت يتم تفعيله بشكل مجاني ",
  'reply_to_message_id'=>$message_id,
'reply_markup'=>$inlinebutton,
 ]);
    }	
  }
	}
}